Reports/А_СравнитьОстаткиВзаиморасчетыСотрудникиЕРПсBASБухгалтерия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>А_СравнитьОстаткиВзаиморасчетыСотрудникиЕРПсBASБухгалтерия</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/А_ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНалоговымНазначениямНДС</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/А_ФормыPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ФормыPL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Форма1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/А_СравнитьОстаткиВзаиморасчетыСотрудникиЕРПсBASБухгалтерия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;
	НачалоПериода = ПараметрПериодОтчета.ДатаНачала;
	КонецПериода = КонецДня(ПараметрПериодОтчета.ДатаОкончания);

	// 1. ЕРП: А_ВзаиморасчетыССотрудниками (Форма1), разрез ФЛ + ОргБух
	ТаблицаЕРП = ПолучитьОстаткиЕРП(НачалоПериода, КонецПериода);

	// 2. BuhBud: Хозрасчетный 661/662/663/665, субконто1 ФЛ, разрез Организация(ЕДРПОУ)
	Попытка
		V83 = А_ПодключенияБазСервер.УстановитьСоединение("bas_industrialbud");
	Исключение
		Сообщить("Помилка підключення до BuhBud: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ТаблицаBuhBud = ПолучитьОстаткиBuhBud(V83, НачалоПериода, КонецПериода);
	V83 = Неопределено;

	// 2.1 Конвертация BuhBud: А_ИдКод/ЕДРПОУ -> ссылки ЕРП
	ТаблицаBuhBud = КонвертироватьТЗ_BuhBud(ТаблицаBuhBud);

	// 3. Объединение по (А_ИдКод, ЕДРПОУ)
	ТаблицаСравнение = ОбъединитьТаблицы(ТаблицаЕРП, ТаблицаBuhBud);

	// 4. Передача в СКД
	ВнешниеНаборыДанных = Новый Структура("Сотрудники_Сравнение", ТаблицаСравнение);

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ЕРП: РегНакопления.А_ВзаиморасчетыССотрудниками.ОстаткиИОбороты, фильтр Форма1.
// Знаки: НачальныйОстаток/КонечныйОстаток signed (+=долг работодателя),
//        Приход=начисление (долг вверх), Расход=выплата/удержание (долг вниз).
Функция ПолучитьОстаткиЕРП(НачалоПериода, КонецПериода)

	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("А_ИдКод", ТипСтрока);
	Результат.Колонки.Добавить("ЕДРПОУ", ТипСтрока);
	Результат.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Результат.Колонки.Добавить("ОрганизацияБухгалтерия", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("НачальныйОстаток_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("Начисления_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("Выплаты_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("КонечныйОстаток_ЕРП", ТипЧисло);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ост.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Ост.ФизическоеЛицо.А_ИдКод КАК А_ИдКод,
	|	Ост.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия,
	|	Ост.ОрганизацияБухгалтерия.КодПоЕДРПОУ КАК ЕДРПОУ,
	|	СУММА(Ост.СуммаВзаиморасчетовНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Ост.СуммаВзаиморасчетовПриход) КАК Начисления,
	|	СУММА(Ост.СуммаВзаиморасчетовРасход) КАК Выплаты,
	|	СУММА(Ост.СуммаВзаиморасчетовКонечныйОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.А_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(
	|		&НачалоПериода,
	|		&КонецПериода,
	|		,
	|		,
	|		ФормаPL = ЗНАЧЕНИЕ(Перечисление.А_ФормыPL.Форма1)) КАК Ост
	|СГРУППИРОВАТЬ ПО
	|	Ост.ФизическоеЛицо,
	|	Ост.ФизическоеЛицо.А_ИдКод,
	|	Ост.ОрганизацияБухгалтерия,
	|	Ост.ОрганизацияБухгалтерия.КодПоЕДРПОУ";

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Сообщить("Помилка запиту ЕРП (А_ВзаиморасчетыССотрудниками): " + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.А_ИдКод = СокрЛП(Выборка.А_ИдКод);
		НоваяСтрока.ЕДРПОУ = СокрЛП(Выборка.ЕДРПОУ);
		НоваяСтрока.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		НоваяСтрока.ОрганизацияБухгалтерия = Выборка.ОрганизацияБухгалтерия;
		НоваяСтрока.НачальныйОстаток_ЕРП = Выборка.НачальныйОстаток;
		НоваяСтрока.Начисления_ЕРП = Выборка.Начисления;
		НоваяСтрока.Выплаты_ЕРП = Выборка.Выплаты;
		НоваяСтрока.КонечныйОстаток_ЕРП = Выборка.КонечныйОстаток;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// BuhBud (COM): РегБух.Хозрасчетный.ОстаткиИОбороты, счета 661/662/663/665, субконто1=ФЛ, разрез Организация(ЕДРПОУ).
// Пассивные счета: сальдо долга = Кт - Дт (signed как в ЕРП). Начисления=ОборотКт, Выплаты=ОборотДт.
// ТЗ содержит ТОЛЬКО примитивы (строки/числа) -> сериализация между базами безопасна.
Функция ПолучитьОстаткиBuhBud(V83, НачалоПериода, КонецПериода)

	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("А_ИдКод", ТипСтрока);
	Результат.Колонки.Добавить("ЕДРПОУ", ТипСтрока);
	Результат.Колонки.Добавить("ФЛ_Наименование", ТипСтрока);
	Результат.Колонки.Добавить("НачальныйОстаток_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("Начисления_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("Выплаты_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("КонечныйОстаток_BuhBud", ТипЧисло);

	// Организации в балансе (ЕДРПОУ) из ЕРП
	ЗапросОрг = Новый Запрос;
	ЗапросОрг.Текст =
	"ВЫБРАТЬ Организации.КодПоЕДРПОУ КАК КодПоЕДРПОУ
	|ИЗ Справочник.Организации КАК Организации
	|ГДЕ Организации.А_ВБалансе = ИСТИНА И Организации.КодПоЕДРПОУ <> """"";
	масЕДРПОУ_V83 = V83.NewObject("Массив");
	ВыборкаОрг = ЗапросОрг.Выполнить().Выбрать();
	Пока ВыборкаОрг.Следующий() Цикл
		масЕДРПОУ_V83.Добавить(ВыборкаОрг.КодПоЕДРПОУ);
	КонецЦикла;
	Если масЕДРПОУ_V83.Количество() = 0 Тогда
		Сообщить("Немає організацій з флагом А_ВБалансе!");
		Возврат Результат;
	КонецЕсли;

	ЗапросBuhBud = V83.NewObject("Запрос");
	ЗапросBuhBud.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросBuhBud.УстановитьПараметр("КонецПериода", КонецПериода);
	ЗапросBuhBud.УстановитьПараметр("масЕДРПОУ", масЕДРПОУ_V83);
	ЗапросBuhBud.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Ост.Субконто1 КАК Справочник.ФизическиеЛица).А_ИдКод КАК А_ИдКод,
	|	ВЫРАЗИТЬ(Ост.Субконто1 КАК Справочник.ФизическиеЛица).Наименование КАК ФЛ_Наименование,
	|	Ост.Организация.КодПоЕДРПОУ КАК ЕДРПОУ,
	|	СУММА(Ост.СуммаНачальныйОстатокДт) КАК НачОстДт,
	|	СУММА(Ост.СуммаНачальныйОстатокКт) КАК НачОстКт,
	|	СУММА(Ост.СуммаОборотДт) КАК ОборотДт,
	|	СУММА(Ост.СуммаОборотКт) КАК ОборотКт,
	|	СУММА(Ост.СуммаКонечныйОстатокДт) КАК КонОстДт,
	|	СУММА(Ост.СуммаКонечныйОстатокКт) КАК КонОстКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , , , ) КАК Ост
	|ГДЕ
	|	Ост.Субконто1 ССЫЛКА Справочник.ФизическиеЛица
	|	И Ост.Организация.КодПоЕДРПОУ В(&масЕДРПОУ)
	|	И Ост.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОплатеТруда))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Ост.Субконто1 КАК Справочник.ФизическиеЛица).А_ИдКод,
	|	ВЫРАЗИТЬ(Ост.Субконто1 КАК Справочник.ФизическиеЛица).Наименование,
	|	Ост.Организация.КодПоЕДРПОУ"; 
	
	Попытка
		ТЗ = ЗапросBuhBud.Выполнить().Выгрузить();
		стр_ТЗ = V83.ЗначениеВСтрокуВнутр(ТЗ);
		ТаблицаBuhBud = ЗначениеИзСтрокиВнутр(стр_ТЗ);
	Исключение
		Сообщить("Помилка запиту BuhBud (661/662/663/665): " + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;

	Для Каждого СтрБ Из ТаблицаBuhBud Цикл
		ИдКод = СокрЛП(СтрБ.А_ИдКод);
		Если ПустаяСтрока(ИдКод) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.А_ИдКод = ИдКод;
		НоваяСтрока.ЕДРПОУ = СокрЛП(СтрБ.ЕДРПОУ);
		НоваяСтрока.ФЛ_Наименование = СокрЛП(СтрБ.ФЛ_Наименование);
		НоваяСтрока.НачальныйОстаток_BuhBud = СтрБ.НачОстКт - СтрБ.НачОстДт;
		НоваяСтрока.Начисления_BuhBud = СтрБ.ОборотКт;
		НоваяСтрока.Выплаты_BuhBud = СтрБ.ОборотДт;
		НоваяСтрока.КонечныйОстаток_BuhBud = СтрБ.КонОстКт - СтрБ.КонОстДт;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Конвертация BuhBud: А_ИдКод -> ФизическиеЛица.Ссылка, ЕДРПОУ -> Организации.Ссылка (ВТ + LEFT JOIN).
Функция КонвертироватьТЗ_BuhBud(ТаблицаBuhBud)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТаблицаBuhBud);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ.А_ИдКод КАК А_ИдКод,
	|	ВТ.ЕДРПОУ КАК ЕДРПОУ,
	|	ВТ.ФЛ_Наименование КАК ФЛ_Наименование,
	|	ВТ.НачальныйОстаток_BuhBud КАК НачальныйОстаток_BuhBud,
	|	ВТ.Начисления_BuhBud КАК Начисления_BuhBud,
	|	ВТ.Выплаты_BuhBud КАК Выплаты_BuhBud,
	|	ВТ.КонечныйОстаток_BuhBud КАК КонечныйОстаток_BuhBud
	|ПОМЕСТИТЬ ВТ_BuhBud
	|ИЗ
	|	&ТЗ КАК ВТ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.А_ИдКод КАК А_ИдКод,
	|	ВТ.ЕДРПОУ КАК ЕДРПОУ,
	|	ВТ.ФЛ_Наименование КАК ФЛ_Наименование,
	|	ФЛ.Ссылка КАК ФизическоеЛицо,
	|	Орг.Ссылка КАК ОрганизацияБухгалтерия,
	|	ВТ.НачальныйОстаток_BuhBud КАК НачальныйОстаток_BuhBud,
	|	ВТ.Начисления_BuhBud КАК Начисления_BuhBud,
	|	ВТ.Выплаты_BuhBud КАК Выплаты_BuhBud,
	|	ВТ.КонечныйОстаток_BuhBud КАК КонечныйОстаток_BuhBud
	|ИЗ
	|	ВТ_BuhBud КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФЛ
	|		ПО ВТ.А_ИдКод = ФЛ.А_ИдКод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Орг
	|		ПО ВТ.ЕДРПОУ = Орг.КодПоЕДРПОУ";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Объединение ЕРП + BuhBud по (А_ИдКод, ЕДРПОУ), расчёт 4 разниц.
Функция ОбъединитьТаблицы(ТаблицаЕРП, ТаблицаBuhBud)

	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Результат.Колонки.Добавить("ОрганизацияБухгалтерия", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("НачальныйОстаток_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("НачальныйОстаток_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("РазницаНачальныйОстаток", ТипЧисло);
	Результат.Колонки.Добавить("Начисления_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("Начисления_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("РазницаНачисления", ТипЧисло);
	Результат.Колонки.Добавить("Выплаты_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("Выплаты_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("РазницаВыплаты", ТипЧисло);
	Результат.Колонки.Добавить("КонечныйОстаток_ЕРП", ТипЧисло);
	Результат.Колонки.Добавить("КонечныйОстаток_BuhBud", ТипЧисло);
	Результат.Колонки.Добавить("РазницаКонечныйОстаток", ТипЧисло);

	Индекс = Новый Соответствие;

	Для Каждого СтрЕ Из ТаблицаЕРП Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ФизическоеЛицо = СтрЕ.ФизическоеЛицо;
		НоваяСтрока.ОрганизацияБухгалтерия = СтрЕ.ОрганизацияБухгалтерия;
		НоваяСтрока.НачальныйОстаток_ЕРП = СтрЕ.НачальныйОстаток_ЕРП;
		НоваяСтрока.Начисления_ЕРП = СтрЕ.Начисления_ЕРП;
		НоваяСтрока.Выплаты_ЕРП = СтрЕ.Выплаты_ЕРП;
		НоваяСтрока.КонечныйОстаток_ЕРП = СтрЕ.КонечныйОстаток_ЕРП;
		Ключ = СтрЕ.А_ИдКод + "|" + СтрЕ.ЕДРПОУ;
		Индекс.Вставить(Ключ, Результат.Индекс(НоваяСтрока));
	КонецЦикла;

	Для Каждого СтрБ Из ТаблицаBuhBud Цикл
		Ключ = СокрЛП(СтрБ.А_ИдКод) + "|" + СокрЛП(СтрБ.ЕДРПОУ);
		НомерСтроки = Индекс.Получить(Ключ);
		Если НомерСтроки <> Неопределено Тогда
			СтрокаРез = Результат.Получить(НомерСтроки);
		Иначе
			СтрокаРез = Результат.Добавить();
			СтрокаРез.ФизическоеЛицо = СтрБ.ФизическоеЛицо;
			СтрокаРез.ОрганизацияБухгалтерия = СтрБ.ОрганизацияБухгалтерия;
		КонецЕсли;
		СтрокаРез.НачальныйОстаток_BuhBud = СтрБ.НачальныйОстаток_BuhBud;
		СтрокаРез.Начисления_BuhBud = СтрБ.Начисления_BuhBud;
		СтрокаРез.Выплаты_BuhBud = СтрБ.Выплаты_BuhBud;
		СтрокаРез.КонечныйОстаток_BuhBud = СтрБ.КонечныйОстаток_BuhBud;
	КонецЦикла;

	Для Каждого СтрР Из Результат Цикл
		СтрР.РазницаНачальныйОстаток = СтрР.НачальныйОстаток_ЕРП - СтрР.НачальныйОстаток_BuhBud;
		СтрР.РазницаНачисления = СтрР.Начисления_ЕРП - СтрР.Начисления_BuhBud;
		СтрР.РазницаВыплаты = СтрР.Выплаты_ЕРП - СтрР.Выплаты_BuhBud;
		СтрР.РазницаКонечныйОстаток = СтрР.КонечныйОстаток_ЕРП - СтрР.КонечныйОстаток_BuhBud;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
